app/controllers/members_controller.rb

INSERT INTO "members" ("created_at", "login", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-20 15:56:34.105306"], ["login", "admin"], ["password", "admin"], ["updated_at", "2014-05-20 15:56:34.105306"]]
---
	def create
		params.require(:member).permit!
		if (from_42_Ldap(params[:member]))
			params[:member][:password] =  Digest::SHA2.hexdigest(params[:member][:password])
			member = Member.new( params[:member] )
			flash[:notice] = 'Member created'
			if (!member.save)

SELECT  "members".* FROM "members"  WHERE "members"."login" = 'tmertz' AND "members"."password" = 'cX6Ip7ho' LIMIT 1
---
	def signin
		if (!(@member = Member.find_by(login: params[:login], password: Digest::SHA2.hexdigest(params[:password]))))

SELECT  "members".* FROM "members"  WHERE "members"."id" = 1 LIMIT 1
---
	def show
		@member = Member.find_by_id( params[:id])